#Query 1
PREFIX vcard:   <http://www.w3.org/2001/vcard-rdf/3.0#>
SELECT ?x
WHERE { ?x  vcard:FN  "Jane Smith" }
Result:
Jane Smith

#Query 2
PREFIX vcard:   <http://www.w3.org/2001/vcard-rdf/3.0#>
SELECT ?z
WHERE { ?x  vcard:FN  ?z }
Results:
Sarah Parker
Matt Parker
Bobby Smith
Jane Smith

#Query 3
PREFIX info:    <http://somewhere/peopleInfo#>
PREFIX vcard:   <http://www.w3.org/2001/vcard-rdf/3.0#>
SELECT ?name ?age
WHERE
{
    ?person vcard:FN  ?name .
    ?person info:age ?age .
}
Results:
Name 		    age
Sarah Parker 	25
Matt Parker 	23
Bobby Smith 	27


#Query 4
PREFIX info:    <http://somewhere/peopleInfo#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX vcard:   <http://www.w3.org/2001/vcard-rdf/3.0#>
SELECT ?name ?age
WHERE
{
    ?person vcard:FN  ?name .
    ?person info:age ?age . 
FILTER (xsd:integer(?age) >= 25)
}
Results:
Name 		    age
Sarah Parker 	25
Bobby Smith 	27

#Query 5 
PREFIX info:    <http://somewhere/peopleInfo#>
PREFIX vcard:   <http://www.w3.org/2001/vcard-rdf/3.0#>
SELECT ?given ?person
WHERE
{

    ?person vcard:N  ?name .
    ?name vcard:Given ?given .
    ?person info:age ?age .
}
Given 	   Person
Sarah 	   Sarah Parker
Bobby 	   Robert Smith
Matthew    Matt Parker
